package static

// https://www.php.net/manual/ja/function.mb-convert-kana.php
const (
	// 「全角」英数字を「半角」に変換
	CONV_HALFWIDTHEISU_FROM_FULLWIDTHEISU string = "a"
	// 「半角」英数字を「全角」に変換
	CONV_FULLWIDTHEISU_FROM_HALFWIDTHEISU string = "A"
	// 「全角」スペースを「半角」に変換
	CONV_HALFWIDTHSPACE_FROM_FULLWIDTHSPACE string = "s"
	// 「半角」スペースを「全角」に変換
	CONV_FULLWIDTHSPACE_FROM_HALFWIDTHSPACE string = "S"
	// 「全角カタカナ」を「半角カタカナ」に変換
	CONV_HALFWIDTHKATA_FROM_FULLWIDTHKATA string = "k"
	// 「全角カタカナ」を「全角ひらがな」
	CONV_HALFWIDTHKATA_FROM_HALFWIDTHKANA string = "c"
	// 「半角カタカナ」を「全角カタカナ」に変換
	CONV_FULLWIDTHKATA_FROM_HALFWIDTHKATA string = "K"
	// 「半角カタカナ」を「全角カタカナ」に変換 1文字の濁点・半濁点を変換
	CONV_FULLWIDTHKATA_FROM_HALFWIDTHKATA_AND_DAKUTEN = "KV"
	// 「全角ひらがな」を「半角カタカナ」に変換
	CONV_HALFWIDTHKANA_FROM_FULLWIDTHHIRA string = "h"
	// 「半角カタカナ」を「全角ひらがな」に変換
	CONV_FULLWIDTHHIRA_FROM_HALFWIDTHKANA string = "H"
	// 「半角カタカナ」を「全角ひらがな」に変換 1文字の濁点・半濁点を変換
	CONV_FULLWIDTHHIRA_FROM_HALFWIDTHKANA_AND_DAKUTEN string = "HV"
)

// 全角カタカナから半角カタカナ置換用
var HalfWidthKataFromFullWidthKata = []string{
	"ア", "ｱ", "イ", "ｲ", "ウ", "ｳ", "エ", "ｴ", "オ", "ｵ",
	"カ", "ｶ", "キ", "ｷ", "ク", "ｸ", "ケ", "ｹ", "コ", "ｺ",
	"サ", "ｻ", "シ", "ｼ", "ス", "ｽ", "セ", "ｾ", "ソ", "ｿ",
	"タ", "ﾀ", "チ", "ﾁ", "ツ", "ﾂ", "テ", "ﾃ", "ト", "ﾄ",
	"ナ", "ﾅ", "ニ", "ﾆ", "ヌ", "ﾇ", "ネ", "ﾈ", "ノ", "ﾉ",
	"ハ", "ﾊ", "ヒ", "ﾋ", "フ", "ﾌ", "ヘ", "ﾍ", "ホ", "ﾎ",
	"マ", "ﾏ", "ミ", "ﾐ", "ム", "ﾑ", "メ", "ﾒ", "モ", "ﾓ",
	"ヤ", "ﾔ", "ユ", "ﾕ", "ヨ", "ﾖ",
	"ラ", "ﾗ", "リ", "ﾘ", "ル", "ﾙ", "レ", "ﾚ", "ロ", "ﾛ",
	"ワ", "ﾜ", "ヲ", "ｦ", "ン", "ﾝ",
	"ヴ", "ｳﾞ", "ガ", "ｶﾞ", "ギ", "ｷﾞ", "グ", "ｸﾞ", "ゲ", "ｹﾞ",
	"ゴ", "ｺﾞ", "ザ", "ｻﾞ", "ジ", "ｼﾞ", "ズ", "ｽﾞ", "ゼ", "ｾﾞ",
	"ゾ", "ｿﾞ", "ダ", "ﾀﾞ", "ヂ", "ﾁﾞ", "ヅ", "ﾂﾞ", "デ", "ﾃﾞ",
	"ド", "ﾄﾞ", "バ", "ﾊﾞ", "ビ", "ﾋﾞ", "ブ", "ﾌﾞ", "ベ", "ﾍﾞ",
	"ボ", "ﾎﾞ", "パ", "ﾊﾟ", "ピ", "ﾋﾟ", "プ", "ﾌﾟ", "ペ", "ﾍﾟ",
	"ポ", "ﾎﾟ",
	"ァ", "ｧ", "ィ", "ｨ", "ゥ", "ｩ", "ェ", "ｪ", "ォ", "ｫ",
	"ャ", "ｬ", "ュ", "ｭ", "ョ", "ｮ", "ッ", "ｯ",
	"、", "､", "。", "｡",
	"ー", "ｰ", "「", "｢", "」", "｣", "゛", "ﾞ", "゜", "ﾟ",
}

// 半角カタカナから全角カタカナ置換用
var FullWidthKataFromHalfWidthKata = []string{
	"ｱ", "ア", "ｲ", "イ", "ｳ", "ウ", "ｴ", "エ", "ｵ", "オ",
	"ｶ", "カ", "ｷ", "キ", "ｸ", "ク", "ｹ", "ケ", "ｺ", "コ",
	"ｻ", "サ", "ｼ", "シ", "ｽ", "ス", "ｾ", "セ", "ｿ", "ソ",
	"ﾀ", "タ", "ﾁ", "チ", "ﾂ", "ツ", "ﾃ", "テ", "ﾄ", "ト",
	"ﾅ", "ナ", "ﾆ", "ニ", "ﾇ", "ヌ", "ﾈ", "ネ", "ﾉ", "ノ",
	"ﾊ", "ハ", "ﾋ", "ヒ", "ﾌ", "フ", "ﾍ", "ヘ", "ﾎ", "ホ",
	"ﾏ", "マ", "ﾐ", "ミ", "ﾑ", "ム", "ﾒ", "メ", "ﾓ", "モ",
	"ﾔ", "ヤ", "ﾕ", "ユ", "ﾖ", "ヨ",
	"ﾗ", "ラ", "ﾘ", "リ", "ﾙ", "ル", "ﾚ", "レ", "ﾛ", "ロ",
	"ﾜ", "ワ", "ｦ", "ヲ", "ﾝ", "ン",

	"ｧ", "ァ", "ｨ", "ィ", "ｩ", "ゥ", "ｪ", "ェ", "ｫ", "ォ",
	"ｬ", "ャ", "ｭ", "ュ", "ｮ", "ョ", "ｯ", "ッ",
	"､", "、", "｡", "。",
	"ｰ", "ー", "｢", "「", "｣", "」", "ﾞ", "゛", "ﾟ", "゜",
}

// 半角カタカナから全角カタカナ+濁点を1文字に置換用 mb_convert_kana($str, "KV")
var KanaDakuten = []string{
	"ウ゛", "ヴ",
	"カ゛", "ガ", "キ゛", "ギ", "ク゛", "グ", "ケ゛", "ゲ", "コ゛", "ゴ",
	"サ゛", "ザ", "シ゛", "ジ", "ス゛", "ズ", "セ゛", "ゼ", "ソ゛", "ゾ",
	"タ゛", "ダ", "チ゛", "ヂ", "ツ゛", "ヅ", "テ゛", "デ", "ト゛", "ド",
	"ハ゛", "バ", "ヒ゛", "ビ", "フ゛", "ブ", "ヘ゛", "ベ", "ホ゛", "ボ",
	"ハ゜", "パ", "ヒ゜", "ピ", "フ゜", "プ", "ヘ゜", "ペ", "ホ゜", "ポ",
}

// 全角ひらがなから半角カタカナ置換用
var HalfWidthKataFromFullWidthHira = []string{
	"あ", "ｱ", "い", "ｲ", "う", "ｳ", "え", "ｴ", "お", "ｵ",
	"か", "ｶ", "き", "ｷ", "く", "ｸ", "け", "ｹ", "こ", "ｺ",
	"さ", "ｻ", "し", "ｼ", "す", "ｽ", "せ", "ｾ", "そ", "ｿ",
	"た", "ﾀ", "ち", "ﾁ", "つ", "ﾂ", "て", "ﾃ", "と", "ﾄ",
	"な", "ﾅ", "に", "ﾆ", "ぬ", "ﾇ", "ね", "ﾈ", "の", "ﾉ",
	"は", "ﾊ", "ひ", "ﾋ", "ふ", "ﾌ", "へ", "ﾍ", "ほ", "ﾎ",
	"ま", "ﾏ", "み", "ﾐ", "む", "ﾑ", "め", "ﾒ", "も", "ﾓ",
	"や", "ﾔ", "ゆ", "ﾕ", "よ", "ﾖ",
	"ら", "ﾗ", "り", "ﾘ", "る", "ﾙ", "れ", "ﾚ", "ろ", "ﾛ",
	"わ", "ﾜ", "を", "ｦ", "ん", "ﾝ",
	"ゔ", "ｳﾞ", "が", "ｶﾞ", "ぎ", "ｷﾞ", "ぐ", "ｸﾞ", "げ", "ｹﾞ",
	"ご", "ｺﾞ", "ざ", "ｻﾞ", "じ", "ｼﾞ", "ず", "ｽﾞ", "ぜ", "ｾﾞ",
	"ぞ", "ｿﾞ", "だ", "ﾀﾞ", "ぢ", "ﾁﾞ", "づ", "ﾂﾞ", "で", "ﾃﾞ",
	"ど", "ﾄﾞ", "ば", "ﾊﾞ", "び", "ﾋﾞ", "ぶ", "ﾌﾞ", "べ", "ﾍﾞ",
	"ぼ", "ﾎﾞ", "ぱ", "ﾊﾟ", "ぴ", "ﾋﾟ", "ぷ", "ﾌﾟ", "ぺ", "ﾍﾟ",
	"ぽ", "ﾎﾟ",
	"ぁ", "ｧ", "ぃ", "ｨ", "ぅ", "ｩ", "ぇ", "ｪ", "ぉ", "ｫ",
	"ゃ", "ｬ", "ゅ", "ｭ", "ょ", "ｮ", "っ", "ｯ",
	"、", "､", "。", "｡",
	"ー", "ｰ", "「", "｢", "」", "｣", "゛", "ﾞ", "゜", "ﾟ",
}

// 半角カタカナから全角ひらがな置換用
var FullWidthHiraFromHalfWidthKata = []string{
	"ｱ", "あ",
	"ｲ", "い",
	"ｳ", "う",
	"ｴ", "え",
	"ｵ", "お",
	"ｶ", "か",
	"ｷ", "き",
	"ｸ", "く",
	"ｹ", "け",
	"ｺ", "こ",
	"ｻ", "さ",
	"ｼ", "し",
	"ｽ", "す",
	"ｾ", "せ",
	"ｿ", "そ",
	"ﾀ", "た",
	"ﾁ", "ち",
	"ﾂ", "つ",
	"ﾃ", "て",
	"ﾄ", "と",
	"ﾅ", "な",
	"ﾆ", "に",
	"ﾇ", "ぬ",
	"ﾈ", "ね",
	"ﾉ", "の",
	"ﾊ", "は",
	"ﾋ", "ひ",
	"ﾌ", "ふ",
	"ﾍ", "へ",
	"ﾎ", "ほ",
	"ﾏ", "ま",
	"ﾐ", "み",
	"ﾑ", "む",
	"ﾒ", "め",
	"ﾓ", "も",
	"ﾔ", "や",
	"ﾕ", "ゆ",
	"ﾖ", "よ",
	"ﾗ", "ら",
	"ﾘ", "り",
	"ﾙ", "る",
	"ﾚ", "れ",
	"ﾛ", "ろ",
	"ﾜ", "わ",
	"ｦ", "を",
	"ﾝ", "ん",
	"ｳﾞ", "ゔ",
	"ｶﾞ", "が",
	"ｷﾞ", "ぎ",
	"ｸﾞ", "ぐ",
	"ｹﾞ", "げ",
	"ｺﾞ", "ご",
	"ｻﾞ", "ざ",
	"ｼﾞ", "じ",
	"ｽﾞ", "ず",
	"ｾﾞ", "ぜ",
	"ｿﾞ", "ぞ",
	"ﾀﾞ", "だ",
	"ﾁﾞ", "ぢ",
	"ﾂﾞ", "づ",
	"ﾃﾞ", "で",
	"ﾄﾞ", "ど",
	"ﾊﾞ", "ば",
	"ﾋﾞ", "び",
	"ﾌﾞ", "ぶ",
	"ﾍﾞ", "べ",
	"ﾎﾞ", "ぼ",
	"ﾊﾟ", "ぱ",
	"ﾋﾟ", "ぴ",
	"ﾌﾟ", "ぷ",
	"ﾍﾟ", "ぺ",
	"ﾎﾟ", "ぽ",
	"ｧ", "ぁ",
	"ｨ", "ぃ",
	"ｩ", "ぅ",
	"ｪ", "ぇ",
	"ｫ", "ぉ",
	"ｬ", "ゃ",
	"ｭ", "ゅ",
	"ｮ", "ょ",
	"ｯ", "っ",
	"､", "、",
	"｡", "。",
	"ｰ", "ー",
	"｢", "「",
	"｣", "」",
	"ﾞ", "゛",
	"ﾟ", "゜",
}

// 半角英数から全角英数置換用
var FullWidthAlphaNumFromHalfWidthAlphaNum = []string{
	"a", "ａ", "b", "ｂ", "c", "ｃ", "d", "ｄ", "e", "ｅ", "f", "ｆ",
	"g", "ｇ", "h", "ｈ", "i", "ｉ", "j", "ｊ", "k", "ｋ", "l", "ｌ",
	"m", "ｍ", "n", "ｎ", "o", "ｏ", "p", "ｐ", "q", "ｑ", "r", "ｒ",
	"s", "ｓ", "t", "ｔ", "u", "ｕ", "v", "ｖ", "w", "ｗ", "x", "ｘ",
	"y", "ｙ", "z", "ｚ",
	"A", "Ａ", "B", "Ｂ", "C", "Ｃ", "D", "Ｄ", "E", "Ｅ", "F", "Ｆ",
	"G", "Ｇ", "H", "Ｈ", "I", "Ｉ", "J", "Ｊ", "K", "Ｋ", "L", "Ｌ",
	"M", "Ｍ", "N", "Ｎ", "O", "Ｏ", "P", "Ｐ", "Q", "Ｑ", "R", "Ｒ",
	"S", "Ｓ", "T", "Ｔ", "U", "Ｕ", "V", "Ｖ", "W", "Ｗ", "X", "Ｘ",
	"Y", "Ｙ", "Z", "Ｚ",
	"0", "０", "1", "１", "2", "２", "3", "３", "4", "４",
	"5", "５", "6", "６", "7", "７", "8", "８", "9", "９",

	"｡", "。", "､", "、", "ｰ", "ー", "｢", "「", "｣", "」", "･", "・",
	"-", "－", "-", "−", "-", "‐", "+", "＋", "=", "＝", ",", "，", "%", "％", "*", "＊",
	"(", "（", ")", "）", "!", "！", `"`, "”", "#", "＃", "$", "＄",
	"&", "＆", ":", "：", "/", "／", "_", "＿", ".", "．", ";", "；",
	"<", "＜", ">", "＞", "?", "？", "@", "＠", "[", "［", "]", "］", "^", "＾", "`", "｀",
	"{", "｛", "}", "｝", "|", "｜",
}

// 全角英数から半角英数置換用
var HalfWidthAlphaNumFromFullWidthAlphaNum = []string{
	"ａ", "a", "ｂ", "b", "ｃ", "c", "ｄ", "d", "ｅ", "e", "ｆ", "f",
	"ｇ", "g", "ｈ", "h", "ｉ", "i", "ｊ", "j", "ｋ", "k", "ｌ", "l",
	"ｍ", "m", "ｎ", "n", "ｏ", "o", "ｐ", "p", "ｑ", "q", "ｒ", "r",
	"ｓ", "s", "ｔ", "t", "ｕ", "u", "ｖ", "v", "ｗ", "w", "ｘ", "x",
	"ｙ", "y", "ｚ", "z",
	"Ａ", "A", "Ｂ", "B", "Ｃ", "C", "Ｄ", "D", "Ｅ", "E", "Ｆ", "F",
	"Ｇ", "G", "Ｈ", "H", "Ｉ", "I", "Ｊ", "J", "Ｋ", "K", "Ｌ", "L",
	"Ｍ", "M", "Ｎ", "N", "Ｏ", "O", "Ｐ", "P", "Ｑ", "Q", "Ｒ", "R",
	"Ｓ", "S", "Ｔ", "T", "Ｕ", "U", "Ｖ", "V", "Ｗ", "W", "Ｘ", "X",
	"Ｙ", "Y", "Ｚ", "Z",
	"０", "0", "１", "1", "２", "2", "３", "3", "４", "4",
	"５", "5", "６", "6", "７", "7", "８", "8", "９", "9",

	"－", "-", "−", "-", "‐", "-", "＋", "+", "＝", "=", "，", ",", "％", "%", "＊", "*",
	"（", "(", "）", ")", "！", "!", "＃", "#", "＄", "$",
	"＆", "&", "：", ":", "／", "/", "＿", "_", "．", ".", "；", ";",
	"＜", "<", "＞", ">", "？", "?", "＠", "@", "［", "[", "］", "]", "＾", "^", "｀", "`",
	"｛", "{", "｝", "}", "｜", "|",
}

// 全角カタカナから全角ひらがな置換用
var FullWidthHiraFromFullWidthKata = []string{
	"ア", "あ", "イ", "い", "ウ", "う", "エ", "え", "オ", "お",
	"カ", "か", "キ", "き", "ク", "く", "ケ", "け", "コ", "こ",
	"サ", "さ", "シ", "し", "ス", "す", "セ", "せ", "ソ", "そ",
	"タ", "た", "チ", "ち", "ツ", "つ", "テ", "て", "ト", "と",
	"ナ", "な", "ニ", "に", "ヌ", "ぬ", "ネ", "ね", "ノ", "の",
	"ハ", "は", "ヒ", "ひ", "フ", "ふ", "ヘ", "へ", "ホ", "ほ",
	"マ", "ま", "ミ", "み", "ム", "む", "メ", "め", "モ", "も",
	"ヤ", "や", "ユ", "ゆ", "ヨ", "よ",
	"ラ", "ら", "リ", "り", "ル", "る", "レ", "れ", "ロ", "ろ",
	"ワ", "わ", "ヲ", "を", "ン", "ん",
	"ヴ", "ゔ", "ガ", "が", "ギ", "ぎ", "グ", "ぐ", "ゲ", "げ",
	"ゴ", "ご", "ザ", "ざ", "ジ", "じ", "ズ", "ず", "ゼ", "ぜ",
	"ゾ", "ぞ", "ダ", "だ", "ヂ", "ぢ", "ヅ", "づ", "デ", "で",
	"ド", "ど", "バ", "ば", "ビ", "び", "ブ", "ぶ", "ベ", "べ",
	"ボ", "ぼ", "パ", "ぱ", "ピ", "ぴ", "プ", "ぷ", "ペ", "ぺ",
	"ポ", "ぽ",
	"ァ", "ぁ", "ィ", "ぃ", "ゥ", "ぅ", "ェ", "ぇ", "ォ", "ぉ",
	"ャ", "ゃ", "ュ", "ゅ", "ョ", "ょ", "ッ", "っ",
	"、", "、", "。", "。",
	"ー", "ー", "「", "「", "」", "」", "゛", "゛", "゜", "゜",
}

var HalfWidthSpaceFromFullWidthSpace = []string{
	"　", " ",
}

var FullWidthSpaceFromHalfWidthSpace = []string{
	" ", "　",
}
